CSI API ETABS v1
cDatabaseTables.GetTableForDisplayCSVFile Method
 Returns data for a single table in a CSV file. If there is nothing to be shown in the table then no data is returned.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForDisplayCSVFile(
	string TableKey,
	ref string[] FieldKeyList,
	string GroupName,
	ref int TableVersion,
	string csvFilePath,
	string sepChar = ","
)
Function GetTableForDisplayCSVFile (
	TableKey As String,
	ByRef FieldKeyList As String(),
	GroupName As String,
	ByRef TableVersion As Integer,
	csvFilePath As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim FieldKeyList As String()
Dim GroupName As String
Dim TableVersion As Integer
Dim csvFilePath As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.GetTableForDisplayCSVFile(TableKey,
	FieldKeyList, GroupName, TableVersion,
	csvFilePath, sepChar)
int GetTableForDisplayCSVFile(
	String^ TableKey,
	array<String^>^% FieldKeyList,
	String^ GroupName,
	int% TableVersion,
	String^ csvFilePath,
	String^ sepChar = L","
)
abstract GetTableForDisplayCSVFile :
        TableKey : string *
        FieldKeyList : string[] byref *
        GroupName : string *
        TableVersion : int byref *
        csvFilePath : string *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key of the table for which data is requested.
FieldKeyList
Type: System.String[]
Input Item: A zero-based array listing the field keys associated with the specified table for which data is requested.
GroupName
Type: System.String
Input Item: The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvFilePath
Type: System.String
Input Item: The fully-qualified path for the CSV file containing the table data.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items, by default ","
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 If the FieldKeyList array contains a single blank string the data will be provided for all fields. If the GroupName is All, or a blank string, then data will be returned for all applicable objects in the model.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace